@kradalby It looks to me like the name of the kind is `PrometheusRule` not `PrometheusRules`. This is the general rule for all kinds defined by CRDs.

It seems to work if you change that:
```
~/test-alpha-168 » terraform plan                                                                                                                                  alex@Alexs-MBP

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # kubernetes_manifest.test will be created
  + resource "kubernetes_manifest" "test" {
      + manifest = {
          + apiVersion = "monitoring.coreos.com/v1"
          + kind       = "PrometheusRule"
          + metadata   = {
              + labels    = {
                  + app = "mixin"
                }
              + name      = "mixin-alerts"
              + namespace = "default"
            }
          + spec       = {}
        }
      + object   = {
          + apiVersion = "monitoring.coreos.com/v1"
          + kind       = "PrometheusRule"
          + metadata   = {
              + annotations                = (known after apply)
              + clusterName                = (known after apply)
              + creationTimestamp          = (known after apply)
              + deletionGracePeriodSeconds = (known after apply)
              + deletionTimestamp          = (known after apply)
              + finalizers                 = (known after apply)
              + generateName               = (known after apply)
              + generation                 = (known after apply)
              + labels                     = {
                  + "app" = "mixin"
                }
              + managedFields              = (known after apply)
              + name                       = "mixin-alerts"
              + namespace                  = "default"
              + ownerReferences            = (known after apply)
              + resourceVersion            = (known after apply)
              + selfLink                   = (known after apply)
              + uid                        = (known after apply)
            }
          + spec       = {
              + groups = (known after apply)
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------
```